Public Attributes | List of all members
API_StairRulesData Struct Reference
Element Manager API
Represents a the Rules and Standards of a Stair element. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | riserHeightMinValue
Minimum riser height.
double  | riserHeightMaxValue
Maximum riser height.
double  | treadDepthMinValue
Minimum going length.
double  | treadDepthMaxValue
Maximum going length.
double  | ruleMinValue
Minimum 2R+G.
double  | ruleMaxValue
Maixmum 2R+G.
double  | landingLengthMinValue
Minimum automatic landing length.
double  | walkingLineOffsetMinValue
Minimum automatic landing offset.
double  | winderTurnOffsetMinValue
Minimum winder width.
double  | riserGoingRatioMinValue
Minimum riser height/tread length ratio.
double  | riserGoingRatioMaxValue
Maximum riser height/tread length ratio.
double  | riserPlusGoingMinValue
Minimum riser height + tread length value.
double  | riserPlusGoingMaxValue
Maximum riser height + tread length value.
double  | stairPitchMinValue
Minimum stair pitch.
double  | stairPitchMaxValue
Maximum stair pitch.
bool  | riserHeightMinApplied
Minimum riser height set.
bool  | riserHeightMaxApplied
Maximum riser height set.
bool  | treadDepthMinApplied
Minimum going length set.
bool  | treadDepthMaxApplied
Maximum going length set.
bool  | ruleMinApplied
Minimum 2R+G set.
bool  | ruleMaxApplied
Maixmum 2R+G set.
bool  | landingLengthMinApplied
Minimum automatic landing length set.
bool  | walkingLineOffsetMinApplied
Minimum automatic landing offset set.
bool  | winderTurnOffsetMinApplied
Minimum winder width set.
bool  | riserGoingRatioMinApplied
Minimum riser height/tread length ratio set.
bool  | riserGoingRatioMaxApplied
Maximum riser height/tread length ratio set.
bool  | riserPlusGoingMinApplied
Minimum riser height + tread length value set.
bool  | riserPlusGoingMaxApplied
Maximum riser height + tread length value set.
bool  | stairPitchMinApplied
Minimum stair pitch set.
bool  | stairPitchMaxApplied
Maximum stair pitch set.
Detailed Description
Represents a the Rules and Standards of a Stair element.
Member Data Documentation
◆ landingLengthMinApplied
 API_StairRulesData::landingLengthMinApplied
Minimum automatic landing length set.
◆ landingLengthMinValue
 API_StairRulesData::landingLengthMinValue
Minimum automatic landing length.
◆ riserGoingRatioMaxApplied
 API_StairRulesData::riserGoingRatioMaxApplied
Maximum riser height/tread length ratio set.
◆ riserGoingRatioMaxValue
 API_StairRulesData::riserGoingRatioMaxValue
Maximum riser height/tread length ratio.
◆ riserGoingRatioMinApplied
 API_StairRulesData::riserGoingRatioMinApplied
Minimum riser height/tread length ratio set.
◆ riserGoingRatioMinValue
 API_StairRulesData::riserGoingRatioMinValue
Minimum riser height/tread length ratio.
◆ riserHeightMaxApplied
 API_StairRulesData::riserHeightMaxApplied
Maximum riser height set.
◆ riserHeightMaxValue
 API_StairRulesData::riserHeightMaxValue
Maximum riser height.
◆ riserHeightMinApplied
 API_StairRulesData::riserHeightMinApplied
Minimum riser height set.
◆ riserHeightMinValue
 API_StairRulesData::riserHeightMinValue
Minimum riser height.
◆ riserPlusGoingMaxApplied
 API_StairRulesData::riserPlusGoingMaxApplied
Maximum riser height + tread length value set.
◆ riserPlusGoingMaxValue
 API_StairRulesData::riserPlusGoingMaxValue
Maximum riser height + tread length value.
◆ riserPlusGoingMinApplied
 API_StairRulesData::riserPlusGoingMinApplied
Minimum riser height + tread length value set.
◆ riserPlusGoingMinValue
 API_StairRulesData::riserPlusGoingMinValue
Minimum riser height + tread length value.
◆ ruleMaxApplied
 API_StairRulesData::ruleMaxApplied
Maixmum 2R+G set.
◆ ruleMaxValue
 API_StairRulesData::ruleMaxValue
Maixmum 2R+G.
◆ ruleMinApplied
 API_StairRulesData::ruleMinApplied
Minimum 2R+G set.
◆ ruleMinValue
 API_StairRulesData::ruleMinValue
Minimum 2R+G.
◆ stairPitchMaxApplied
 API_StairRulesData::stairPitchMaxApplied
Maximum stair pitch set.
◆ stairPitchMaxValue
 API_StairRulesData::stairPitchMaxValue
Maximum stair pitch.
◆ stairPitchMinApplied
 API_StairRulesData::stairPitchMinApplied
Minimum stair pitch set.
◆ stairPitchMinValue
 API_StairRulesData::stairPitchMinValue
Minimum stair pitch.
◆ treadDepthMaxApplied
 API_StairRulesData::treadDepthMaxApplied
Maximum going length set.
◆ treadDepthMaxValue
 API_StairRulesData::treadDepthMaxValue
Maximum going length.
◆ treadDepthMinApplied
 API_StairRulesData::treadDepthMinApplied
Minimum going length set.
◆ treadDepthMinValue
 API_StairRulesData::treadDepthMinValue
Minimum going length.
◆ walkingLineOffsetMinApplied
 API_StairRulesData::walkingLineOffsetMinApplied
Minimum automatic landing offset set.
◆ walkingLineOffsetMinValue
 API_StairRulesData::walkingLineOffsetMinValue
Minimum automatic landing offset.
◆ winderTurnOffsetMinApplied
 API_StairRulesData::winderTurnOffsetMinApplied
Minimum winder width set.
◆ winderTurnOffsetMinValue
 API_StairRulesData::winderTurnOffsetMinValue
Minimum winder width.